soaptest/ns2.add.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://tempuri.org/ns2.xsd">
 <SOAP-ENV:Body>
  <ns2:add>
   <num1>0</num1>
   <num2>0</num2>
  </ns2:add>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
